Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྐྱེས་པ་རང་བཞིན་གྱིས་སྟོང་པ་སྐྱེ་བར་མི་འདོད་དོ།
en: Venerable Śāradvatīputra, I do not hold that arising [spiritual goals], up to and including all-aspect omniscience, which are empty of inherent existence, arise.” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་སྐྱེ་བ་སྐྱེའམ། འོན་ཏམ་སྐྱེ་བ་མི་སྐྱེ།
en: Venerable Subhūti, does arising arise, or else, does nonarising arise?” “

source: སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྐྱེ་བ་ཡང་མི་སྐྱེ་མི་སྐྱེ་བ་ཡང་མི་སྐྱེའོ།
en: Venerable Śāradvatīputra, arising does not arise, nor does nonarising arise.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྐྱེ་བ་གང་ཡིན་པ་དང་སྐྱེ་བ་མེད་པ་གང་ཡིན་པའི་ཆོས་དེ་གཉིས་ཀ་ཡང་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན། གཟུགས་མེད་པ་བལྟར་མེད་པ་ཐོགས་པ་མེད་པ་སྟེ། འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པའོ།
en: If you ask why, Venerable Śāradvatīputra, it is because both phenomena that arise and phenomena that are nonarising are neither conjoined, nor disjoined, and they share a single defining characteristic in that they are all immaterial, unrevealed, unimpeded, and without defining characteristics.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་རྣམ་གྲངས་དེས་ན། སྐྱེ་བ་ཡང་མི་སྐྱེ་མི་སྐྱེ་བ་ཡང་མི་སྐྱེའོ།
en: Those, Venerable Śāradvatīputra, are the formulations explaining how arising does not arise, nor does nonarising arise.”

source: །ཤ་ར་དྭ་ཏིའི་བུས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་མ་སྐྱེས་པའི་ཆོས་མ་སྐྱེས་པའི་ཆོས་ཤེས་བྱ་བར་བརྗོད་པར་ཁྱོད་ཀྱིས་སྤོབས་ན། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་མ་སྐྱེས་པ་རྣམས་ཀྱི་སྐྱེ་བ་མེད་པ་ལ་ཡང་བརྗོད་དུ་སྤོབས་པར་འགྱུར་རམ།
en: The venerable Śāradvatīputra then asked, “Venerable Subhūti, if are you inspired to say that nonarising phenomena are indeed nonarising phenomena, then, Venerable Subhūti, are you inspired also to say that there is no arising with respect to nonarising phenomena?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མ་སྐྱེས་པའི་ཆོས་མ་སྐྱེས་པའི་ཆོས་ཤེས་བྱ་བ་བརྗོད་པར་ཁྱོད་ཀྱིས་སྤོབས་སོ།
en: Venerable Śāradvatīputra,” replied Subhūti, “you ask whether I am inspired to say that nonarising phenomena are indeed nonarising phenomena.

source: །ཞེས་ཟེར་བ་ནི། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མ་སྐྱེས་པའི་ཆོས་མ་སྐྱེས་པའི་ཆོས་ཤེས་བྱ་བ་བརྗོད་པ་ལ་བདག་གིས་སྤོབས་པ་མེད་དོ།
en: In that regard, Venerable Śāradvatīputra, I am not inspired to say that nonarising phenomena are indeed nonarising phenomena.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་མ་སྐྱེས་པ་རྣམས་ཀྱི་སྐྱེ་བ་མེད་པ་ཡང་བདག་གིས་བརྗོད་པར་སྤོབས་པ་མེད་དེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་མ་སྐྱེས་པའི་ཆོས་གང་ཡིན་པ་དང་། སྐྱེ་བ་མེད་པ་གང་ཡིན་པ་དང་། སྤོབས་པ་གང་ཡིན་པ་དང་།
en: Nor am I inspired, Venerable Śāradvatīputra, to say that there is no arising with respect to nonarising phenomena.

source: བརྗོད་པ་གང་ཡིན་པ་དང་། མི་སྐྱེ་བ་གང་ཡིན་པའི་ཆོས་དེ་དག་ཐམས་ཅད་ཀྱང་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན། གཟུགས་མེད་པ་བལྟར་མེད་པ་ཐོགས་པ་མེད་པ་སྟེ། འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པ་དག་གོ །
en: If you ask why, Venerable Śāradvatīputra, it is because nonarising phenomena, the absence of arising, the act of inspired speech, the statements that are expressed, and the phenomena that do not arise are all neither conjoined, nor disjoined, and they share a single defining characteristic in that they are all immaterial, unrevealed, unimpeded, and without defining characteristics.” “

source: སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བརྗོད་པ་ནི་སྐྱེ་བ་མེད་ཅེས་བྱ་བ་ཡིན་ཏེ། སྤོབས་པ་ཡང་སྐྱེ་བ་མེད་ལ་ཆོས་ཀྱང་སྐྱེ་བ་མེད་དེ། གང་ལས་བརྩམས་ཤིང་བརྗོད་པར་སྤོབས་པའི་ཆོས་དེ་དག་ཀྱང་སྐྱེ་བ་མེད་པ་ཡིན་ནམ།
en: Venerable Subhūti, is it then the case that those statements are nonarising, that the act of inspired speech is also nonarising, and that those phenomena about which you were inspired to say what you said are also nonarising?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ཏེ།
en: Venerable Śāradvatīputra, it is so!

source: བརྗོད་པ་ནི་མ་སྐྱེས་པའོ། །སྤོབས་པ་ནི་མ་སྐྱེས་པའོ། །ཆོས་ནི་མ་སྐྱེས་པའོ། །གང་ལས་བརྩམས་ཏེ་སྨྲ་བར་སྤོབས་པའི་ཆོས་དེ་དག་ཀྱང་མ་སྐྱེས་པའོ།
en: Those statements are nonarising, the act of inspired speech is nonarising, and those phenomena about which I was inspired to say what I said are also nonarising.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་འདི་ལྟར་གཟུགས་སྐྱེ་བ་མེད་དོ།
en: If you ask why, Venerable Śāradvatīputra, it is because physical forms are nonarising.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་སྐྱེ་བ་མེད་དོ།
en: Feelings, perceptions, formative predispositions, and consciousness are nonarising.

source: །མིག་སྐྱེ་བ་མེད་དོ།
en: The eyes are nonarising.

source: །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་སྐྱེ་བ་མེད་དོ།
en: The ears, nose, tongue, body, and mental faculty are nonarising.

source: །གཟུགས་སྐྱེ་བ་མེད་དོ།
en: Sights are nonarising.

source: །སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་སྐྱེ་བ་མེད་དོ།
en: Sounds, odors, tastes, tangibles, and mental phenomena are nonarising.

source: །མིག་གི་རྣམ་པར་ཤེས་པ་སྐྱེ་བ་མེད་དོ།
en: Visual consciousness is nonarising.

source: །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་སྐྱེ་བ་མེད་དོ།
en: Auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are nonarising.

source: །མིག་གི་འདུས་ཏེ་རེག་པ་སྐྱེ་བ་མེད་དོ།
en: Visually compounded sensory contact is nonarising.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་སྐྱེ་བ་མེད་དོ།
en: Aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are nonarising.

source: །མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་སྐྱེ་བ་མེད་དོ།
en: Feelings due to sensory contact that is visually compounded are nonarising.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་སྐྱེ་བ་མེད་དོ།
en: Feelings due to sensory contact that is aurally compounded, feelings due to sensory contact that is nasally compounded, feelings due to sensory contact that is lingually compounded, feelings due to sensory contact that is corporeally contacted, and feelings due to sensory contact that is mentally compounded are nonarising.

source: །སའི་ཁམས་སྐྱེ་བ་མེད་དོ།
en: The earth element is nonarising.

source: །ཆུའི་ཁམས་སྐྱེ་བ་མེད་དོ།
en: The water element is nonarising.

source: །མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་སྐྱེ་བ་མེད་དོ།
en: The fire element, the wind element, the space element, and the consciousness element are nonarising.

source: །མ་རིག་པ་སྐྱེ་བ་མེད་དོ།
en: Fundamental ignorance is nonarising.

source: །འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་། མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་སྐྱེ་བ་དང་རྒ་ཤི་སྐྱེ་བ་མེད་དོ།
en: Formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death are nonarising.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་སྐྱེ་བ་མེད་དོ།
en: The perfection of generosity is nonarising.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྐྱེ་བ་མེད་དོ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are nonarising.

source: །ནང་སྟོང་པ་ཉིད་སྐྱེ་བ་མེད་དོ།
en: The emptiness of internal phenomena is nonarising.

source: །ཕྱི་སྟོང་པ་ཉིད་སྐྱེ་བ་མེད་དོ།
en: The emptiness of external phenomena is nonarising.

source: །ཕྱི་ནང་སྟོང་པ་ཉིད་སྐྱེ་བ་མེད་དོ།
en: The emptiness of external and internal phenomena is nonarising. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྐྱེ་བ་མེད་དོ།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are nonarising.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སྐྱེ་བ་མེད་དོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: The applications of mindfulness are nonarising.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྐྱེ་བ་མེད་དོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are nonarising.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སྐྱེ་བ་མེད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། བརྗོད་པ་ནི་སྐྱེ་བ་མེད་པ་སྟེ། སྤོབས་པ་ཡང་སྐྱེ་བ་མེད་ལ་ཆོས་ཀྱང་སྐྱེ་བ་མེད་དེ་གང་ལས་བརྩམས་ཤིང་བརྗོད་པར་སྤོབས་པའི་ཆོས་དེ་དག་ཀྱང་སྐྱེ་བ་མེད་པའོ།
en: Those, Venerable Śāradvatīputra, are the formulations explaining how these statements are indeed nonarising, how the act of inspired speech, too, is nonarising, and how those phenomena about which there is the inspiration to make statements are also nonarising!” {

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ནི་ཆོས་སྨྲ་བའི་ནང་ན་མཆོག་ཏུ་བྱ་བར་འོས་པ་སྟེ།
en: Dt.263} The venerable Śāradvatīputra then exclaimed, “Venerable Subhūti should rightly be established as foremost among those who teach the Dharma!

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་གནས་བརྟན་རབ་འབྱོར་ནི་གང་དང་གང་ཡོངས་སུ་དྲིས་པ་དེ་དང་དེ་ལ་ཐོགས་པ་མེད་དོ།
en: If you ask why, it is because whatever the elder Subhūti is asked, in that regard he has no impediment!” “

source: །རབ་འབྱོར་གྱིས་སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས། ཆོས་ཐམས་ཅད་ལ་གནས་པ་མེད་པ་དག་གི་ཆོས་ཉིད་དེ།
en: Venerable Śāradvatīputra,” replied Subhūti, “it is the true nature of the śrāvakas of the Blessed One that they do not take any phenomena as their support.

source: དེ་དག་ནི་གང་དང་གང་ཡོངས་སུ་དྲིས་པ་དེ་དང་དེ་ལ་ཐོགས་པ་མེད་དོ།
en: Whatever they are asked, in that regard they have no impediment!

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་མི་གནས་པའི་ཕྱིར་རོ།
en: If you ask why, it is because all phenomena are without support.” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཇི་ལྟར་ན་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་མི་གནས་པ་ཡིན།
en: Venerable Subhūti, in what way are all phenomena, being emptiness, without support?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས།
en: Venerable Śāradvatīputra,” replied Subhūti, “physical forms, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes].

source: གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, feelings, perceptions, formative predispositions, and consciousness, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes]. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མིག་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, the eyes, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes].

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, the ears, the nose, the tongue, the body, and the mental faculty, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes].

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, sights, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes].

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, sounds, odors, tastes, tangibles, and mental phenomena, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes]. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མིག་གི་རྣམ་པར་ཤེས་པ་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་།
en: Venerable Śāradvatīputra, visual consciousness, being empty of inherent existence, is internally without support, it is externally without support, and there is no support apprehended outside these two [extremes].

source: སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes]. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མིག་གི་འདུས་ཏེ་རེག་པ་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་།
en: Venerable Śāradvatīputra, visually compounded sensory contact, being empty of inherent existence, is internally without support, it is externally without support, and there is no support apprehended outside these two [extremes].

source: སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes]. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་།
en: Venerable Śāradvatīputra, feelings due to sensory contact that is visually compounded, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes].

source: སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, feelings due to sensory contact that is aurally compounded, feelings due to sensory contact that is nasally compounded, feelings due to sensory contact that is lingually compounded, feelings due to sensory contact that is corporeally contacted, and feelings due to sensory contact that is mentally compounded, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes]. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སའི་ཁམས་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, the earth element, being empty of inherent existence, is internally without support, it is externally without support, and there is no support apprehended outside these two [extremes].

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཆུའི་ཁམས་དང་མེའི་ཁམས་དང་རླུང་གི་ཁམས་དང་ནམ་མཁའི་ཁམས་དང་རྣམ་པར་ཤེས་པའི་ཁམས་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, the water element, the fire element, the wind element, the space element, and the consciousness element, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes]. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མ་རིག་པ་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, ignorance, being empty of inherent existence, is internally without support, it is externally without support, and there is no support apprehended outside these two [extremes].

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་སྐྱེ་བ་དང་རྒ་ཤི་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes]. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Venerable Śāradvatīputra, the perfection of generosity, being empty of inherent existence, is internally without support, it is externally without support, and there is no support apprehended outside these two [extremes].

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes]. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ནང་སྟོང་པ་ཉིད་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, the emptiness of internal phenomena, being empty of inherent existence, is internally without support, it is externally without support, and there is no support apprehended outside these two [extremes].

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes]. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་།
en: Venerable Śāradvatīputra, the applications of mindfulness, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes].

source: སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་།
en: Venerable Śāradvatīputra, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes].

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་དང་།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes]. “

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས་གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, [the spiritual goals], up to and including all-aspect omniscience, being empty of inherent existence, are internally without support, they are externally without support, and there is no support apprehended outside these two [extremes]. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་མི་གནས་སོ།
en: Venerable Śāradvatīputra, those are the formulations explaining how all phenomena are without support because they are empty of inherent existence.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པས། དེ་ལྟར་གཟུགས་ཡོངས་སུ་སྦྱང་བར་བྱའོ།
en: Venerable Śāradvatīputra, bodhisattva great beings who practice the six perfections should refine physical forms in that manner.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཡོངས་སུ་སྦྱང་བར་བྱའོ།
en: They should refine feelings, perceptions, formative predispositions, and consciousness.
